tap "buo/cask-upgrade"
# tap "heroku/brew"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
# tap "homebrew/services"
# tap "osx-cross/arm"
# tap "osx-cross/avr"
# tap "qmk/qmk"
# Programmable completion for Bash 3.2
# brew "bash-completion"
# Core application library for C
# brew "glib"
# Cross-platform make
# brew "cmake"
# Dependency Manager for PHP
# brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
# brew "libssh2"
# Open source suite of directory software
# brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
# brew "curl"
# GNU multiple precision arithmetic library
# brew "gmp"
# Generic library support script
# brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
# brew "guile"
# Validating, recursive, caching DNS resolver
# brew "unbound"
# GNU Transport Layer Security (TLS) Library
# brew "gnutls"
# Generate introspection data for GObject libraries
# brew "gobject-introspection"
# OpenType text shaping engine
# brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
# brew "libass"
# NaCl networking and cryptography library
# brew "libsodium"
# Secure Reliable Transport
# brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
# brew "freetds"
# Quickly rewrite git repository history
# brew "git-filter-repo"
# Git extension for versioning large files
# brew "git-lfs"
# Command-line option parsing utility
# brew "gnu-getopt"
# Open source programming language to build simple/reliable/efficient software
# brew "go"
# Reliable, high performance TCP/HTTP load balancer
# brew "haproxy"
# Apache HTTP server
# brew "httpd"
# Database of common MIME types
# brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
# brew "libheif"
# Interpreted, interactive, object-oriented programming language
# brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
# brew "jq"
# Network authentication protocol
# brew "krb5"
# High performance, distributed memory object caching system
# brew "memcached", restart_service: true
# C and C++ client library to the memcached server
# brew "libmemcached"
# Postgres C API library
# brew "libpq"
# Apache Kafka C/C++ library
# brew "librdkafka"
# USB multiplexor library for iOS devices
# brew "libusbmuxd"
# XML security library
# brew "libxmlsec1"
# Rainbows and unicorns in your console!
# brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Cross platform, open source .NET development framework
# brew "mono"
# Open source relational database management system
# brew "mysql@5.7", link: true
# HTTP/2 C Library
# brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
# brew "nginx"
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
# brew "php@7.2"
# Object-relational database system
# brew "postgresql"
# Framework for managing multi-language pre-commit hooks
# brew "pre-commit"
# Install various Ruby versions and implementations
# brew "ruby-build"
# Ruby version manager
# brew "rbenv"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
# brew "ruby"
# Package any app for every Linux desktop, server, cloud or device
brew "snapcraft"
# SOcket CAT: netcat on steroids
# brew "socat"
# Watch files and take action when they change
# brew "watchman"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Tool for managing your YubiKey configuration
# brew "ykman"
# YubiKey personalization library and tool
# brew "ykpers"
# Command-line tool for the YubiKey PIV application
# brew "yubico-piv-tool"
# General-purpose lossless data-compression library
brew "zlib"
# zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Everything you need to get started with Heroku
# brew "heroku/brew/heroku"
# Quantum Mechanical Keyboard (QMK) Firmware
# brew "qmk/qmk/qmk"
# Password manager that keeps all passwords secure behind one password
# cask "1password"
# Text editor
# cask "atom"
# Open-source code editor for web-developement
# cask "brackets"
# cask "chefdk"
# Automated testing of webapps for Google Chrome
# cask "chromedriver"
# App for building websites
# cask "codekit"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
# cask "docker"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
# cask "qlcolorcode"
# QuickLook generator for Markdown files
# cask "qlmarkdown"
# cask "qlprettypatch"
# cask "qlstephen"
# cask "qlvideo"
# cask "quicklook-csv"
# cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
# cask "quicklookase"
# Music streaming service
# cask "spotify"
# Text editor for code, markup and prose
# cask "sublime-text"
# Application for inspecting installer packages
# cask "suspicious-package"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Development environment
# cask "vagrant"
# Multimedia player
# cask "vlc"
# Create, manage, and run virtual machines
# cask "vmware-fusion"
# cask "webpquicklook"
# Open-source version of the X.Org X Window System
cask "xquartz"
# mas "Amphetamine", id: 937984704
# mas "BetterSnapTool", id: 417375580
# mas "Flycut", id: 442160987
# mas "iMovie", id: 408981434
